# [길이가 n인 계단 수]

# n=1
# 2 3 4 5 6 7 8 --> 2개
# 1 9  --> 

# n=2
# 10 12  21 23  32 34  43 45  54 56  65 67  76 78  87 89  98

#             0 1 2 3 4 5 6 7 8 9
# 자리수 (1)      1 1 1 1 1 1 1 1 1
# 자리수 (2)    1 1 2 2 2 2 2 2 2 1
# 자리수 (3)    1 3 3 4 4 4 4 4 3 2

n = int(input())

dp    = [[0]*10 for _ in range(100)]
dp[0] = [1 for _ in range(10)]; dp[0][0]=0

for i in range(1,n):
    dp[i][0]=dp[i-1][1] # 0
    dp[i][9]=dp[i-1][8] # 9
    for j in range(1,9): # 1~8
        dp[i][j]=dp[i-1][j-1]+dp[i-1][j+1]
print(sum(dp[n-1])%1000000000)