# RGB거리

# 30   19  (5)   --->  (5)  19  30
# (64) 77  64    --->  (64) 64  77
# 15 (19)  97    --->  15 (19)  97
# 4    71  57
# 90   86   84
# 93   32   91

# 30   19   (5)
# (64) 77   64 -->  69     72     83
# 15   (19) 97 -->  87     88     1000
# (4)  71   57 -->  92     158    144
# 90   86   (84)--> 1000   178    176
# 93  (32)  91  --> 1000   208    269

dp = []
n = int(input())
dp.append(list(map(int, input().split())))
for i in range(1, n):
    dp.append(list(map(int, input().split())))
    dp[i][0] = min(dp[i-1][1],dp[i-1][2]) + dp[i][0]
    dp[i][1] = min(dp[i-1][0],dp[i-1][2]) + dp[i][1]
    dp[i][2] = min(dp[i-1][0],dp[i-1][1]) + dp[i][2]
    
print(min(dp[n-1]))